Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/tsens.h
#define TSENS_STATUS_OVF_Pos                  _U_(0)                                               /**< (TSENS_STATUS) Result Overflow Position */
#define TSENS_STATUS_OVF_Msk                  (_U_(0x1) << TSENS_STATUS_OVF_Pos)                   /**< (TSENS_STATUS) Result Overflow Mask */
#define TSENS_STATUS_OVF(value)               (TSENS_STATUS_OVF_Msk & ((value) << TSENS_STATUS_OVF_Pos))
#define TSENS_STATUS_Msk                      _U_(0x01)                                            /**< (TSENS_STATUS) Register Mask  */


/* -------- TSENS_SYNCBUSY : (TSENS Offset: 0x08) ( R/ 32) Synchronization Busy Register -------- */
#define TSENS_SYNCBUSY_RESETVALUE             _U_(0x00)                                            /**<  (TSENS_SYNCBUSY) Synchronization Busy Register  Reset Value */

#define TSENS_SYNCBUSY_SWRST_Pos              _U_(0)                                               /**< (TSENS_SYNCBUSY) Software Reset Busy Position */
#define TSENS_SYNCBUSY_SWRST_Msk              (_U_(0x1) << TSENS_SYNCBUSY_SWRST_Pos)               /**< (TSENS_SYNCBUSY) Software Reset Busy Mask */
#define TSENS_SYNCBUSY_SWRST(value)           (TSENS_SYNCBUSY_SWRST_Msk & ((value) << TSENS_SYNCBUSY_SWRST_Pos))
#define TSENS_SYNCBUSY_ENABLE_Pos             _U_(1)                                               /**< (TSENS_SYNCBUSY) Enable Busy Position */
#define TSENS_SYNCBUSY_ENABLE_Msk             (_U_(0x1) << TSENS_SYNCBUSY_ENABLE_Pos)              /**< (TSENS_SYNCBUSY) Enable Busy Mask */
#define TSENS_SYNCBUSY_ENABLE(value)          (TSENS_SYNCBUSY_ENABLE_Msk & ((value) << TSENS_SYNCBUSY_ENABLE_Pos))
#define TSENS_SYNCBUSY_Msk                    _U_(0x00000003)                                      /**< (TSENS_SYNCBUSY) Register Mask  */


/* -------- TSENS_VALUE : (TSENS Offset: 0x0C) ( R/ 32) Value Register -------- */
#define TSENS_VALUE_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_VALUE) Value Register  Reset Value */

#define TSENS_VALUE_VALUE_Pos                 _U_(0)                                               /**< (TSENS_VALUE) Measurement Value Position */
#define TSENS_VALUE_VALUE_Msk                 (_U_(0xFFFFFF) << TSENS_VALUE_VALUE_Pos)             /**< (TSENS_VALUE) Measurement Value Mask */
#define TSENS_VALUE_VALUE(value)              (TSENS_VALUE_VALUE_Msk & ((value) << TSENS_VALUE_VALUE_Pos))
#define TSENS_VALUE_Msk                       _U_(0x00FFFFFF)                                      /**< (TSENS_VALUE) Register Mask  */


/* -------- TSENS_WINLT : (TSENS Offset: 0x10) (R/W 32) Window Monitor Lower Threshold Register -------- */
#define TSENS_WINLT_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_WINLT) Window Monitor Lower Threshold Register  Reset Value */

#define TSENS_WINLT_WINLT_Pos                 _U_(0)                                               /**< (TSENS_WINLT) Window Lower Threshold Position */
#define TSENS_WINLT_WINLT_Msk                 (_U_(0xFFFFFF) << TSENS_WINLT_WINLT_Pos)             /**< (TSENS_WINLT) Window Lower Threshold Mask */
#define TSENS_WINLT_WINLT(value)              (TSENS_WINLT_WINLT_Msk & ((value) << TSENS_WINLT_WINLT_Pos))
#define TSENS_WINLT_Msk                       _U_(0x00FFFFFF)                                      /**< (TSENS_WINLT) Register Mask  */


/* -------- TSENS_WINUT : (TSENS Offset: 0x14) (R/W 32) Window Monitor Upper Threshold Register -------- */
#define TSENS_WINUT_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_WINUT) Window Monitor Upper Threshold Register  Reset Value */

#define TSENS_WINUT_WINUT_Pos                 _U_(0)                                               /**< (TSENS_WINUT) Window Upper Threshold Position */
#define TSENS_WINUT_WINUT_Msk                 (_U_(0xFFFFFF) << TSENS_WINUT_WINUT_Pos)             /**< (TSENS_WINUT) Window Upper Threshold Mask */
#define TSENS_WINUT_WINUT(value)              (TSENS_WINUT_WINUT_Msk & ((value) << TSENS_WINUT_WINUT_Pos))
#define TSENS_WINUT_Msk                       _U_(0x00FFFFFF)                                      /**< (TSENS_WINUT) Register Mask  */


/* -------- TSENS_GAIN : (TSENS Offset: 0x18) (R/W 32) Gain Register -------- */
#define TSENS_GAIN_RESETVALUE                 _U_(0x00)                                            /**<  (TSENS_GAIN) Gain Register  Reset Value */

#define TSENS_GAIN_GAIN_Pos                   _U_(0)                                               /**< (TSENS_GAIN) Time Amplifier Gain Position */
#define TSENS_GAIN_GAIN_Msk                   (_U_(0xFFFFFF) << TSENS_GAIN_GAIN_Pos)               /**< (TSENS_GAIN) Time Amplifier Gain Mask */
#define TSENS_GAIN_GAIN(value)                (TSENS_GAIN_GAIN_Msk & ((value) << TSENS_GAIN_GAIN_Pos))
#define TSENS_GAIN_Msk                        _U_(0x00FFFFFF)                                      /**< (TSENS_GAIN) Register Mask  */


/* -------- TSENS_OFFSET : (TSENS Offset: 0x1C) (R/W 32) Offset Register -------- */
#define TSENS_OFFSET_RESETVALUE               _U_(0x00)                                            /**<  (TSENS_OFFSET) Offset Register  Reset Value */

#define TSENS_OFFSET_OFFSETC_Pos              _U_(0)                                               /**< (TSENS_OFFSET) Offset Correction Position */
#define TSENS_OFFSET_OFFSETC_Msk              (_U_(0xFFFFFF) << TSENS_OFFSET_OFFSETC_Pos)          /**< (TSENS_OFFSET) Offset Correction Mask */
#define TSENS_OFFSET_OFFSETC(value)           (TSENS_OFFSET_OFFSETC_Msk & ((value) << TSENS_OFFSET_OFFSETC_Pos))
#define TSENS_OFFSET_Msk                      _U_(0x00FFFFFF)                                      /**< (TSENS_OFFSET) Register Mask  */


/* -------- TSENS_CAL : (TSENS Offset: 0x20) (R/W 32) Calibration Register -------- */
#define TSENS_CAL_RESETVALUE                  _U_(0x00)                                            /**<  (TSENS_CAL) Calibration Register  Reset Value */

#define TSENS_CAL_FCAL_Pos                    _U_(0)                                               /**< (TSENS_CAL) Frequency Calibration Position */
#define TSENS_CAL_FCAL_Msk                    (_U_(0x3F) << TSENS_CAL_FCAL_Pos)                    /**< (TSENS_CAL) Frequency Calibration Mask */
#define TSENS_CAL_FCAL(value)                 (TSENS_CAL_FCAL_Msk & ((value) << TSENS_CAL_FCAL_Pos))
#define TSENS_CAL_TCAL_Pos                    _U_(8)                                               /**< (TSENS_CAL) Temperature Calibration Position */
#define TSENS_CAL_TCAL_Msk                    (_U_(0x3F) << TSENS_CAL_TCAL_Pos)                    /**< (TSENS_CAL) Temperature Calibration Mask */
#define TSENS_CAL_TCAL(value)                 (TSENS_CAL_TCAL_Msk & ((value) << TSENS_CAL_TCAL_Pos))
#define TSENS_CAL_Msk                         _U_(0x00003F3F)                                      /**< (TSENS_CAL) Register Mask  */


