Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/tsens.h
/* -------- TSENS_DBGCTRL : (TSENS Offset: 0x24) (R/W 8) Debug Control Register -------- */
#define TSENS_DBGCTRL_RESETVALUE              _U_(0x00)                                            /**<  (TSENS_DBGCTRL) Debug Control Register  Reset Value */

#define TSENS_DBGCTRL_DBGRUN_Pos              _U_(0)                                               /**< (TSENS_DBGCTRL) Debug Run Position */
#define TSENS_DBGCTRL_DBGRUN_Msk              (_U_(0x1) << TSENS_DBGCTRL_DBGRUN_Pos)               /**< (TSENS_DBGCTRL) Debug Run Mask */
#define TSENS_DBGCTRL_DBGRUN(value)           (TSENS_DBGCTRL_DBGRUN_Msk & ((value) << TSENS_DBGCTRL_DBGRUN_Pos))
#define TSENS_DBGCTRL_Msk                     _U_(0x01)                                            /**< (TSENS_DBGCTRL) Register Mask  */


/** \brief TSENS register offsets definitions */
#define TSENS_CTRLA_REG_OFST           (0x00)              /**< (TSENS_CTRLA) Control A Register Offset */
#define TSENS_CTRLB_REG_OFST           (0x01)              /**< (TSENS_CTRLB) Control B Register Offset */
#define TSENS_CTRLC_REG_OFST           (0x02)              /**< (TSENS_CTRLC) Control C Register Offset */
#define TSENS_EVCTRL_REG_OFST          (0x03)              /**< (TSENS_EVCTRL) Event Control Register Offset */
#define TSENS_INTENCLR_REG_OFST        (0x04)              /**< (TSENS_INTENCLR) Interrupt Enable Clear Register Offset */
#define TSENS_INTENSET_REG_OFST        (0x05)              /**< (TSENS_INTENSET) Interrupt Enable Set Register Offset */
#define TSENS_INTFLAG_REG_OFST         (0x06)              /**< (TSENS_INTFLAG) Interrupt Flag Status and Clear Register Offset */
#define TSENS_STATUS_REG_OFST          (0x07)              /**< (TSENS_STATUS) Status Register Offset */
#define TSENS_SYNCBUSY_REG_OFST        (0x08)              /**< (TSENS_SYNCBUSY) Synchronization Busy Register Offset */
#define TSENS_VALUE_REG_OFST           (0x0C)              /**< (TSENS_VALUE) Value Register Offset */
#define TSENS_WINLT_REG_OFST           (0x10)              /**< (TSENS_WINLT) Window Monitor Lower Threshold Register Offset */
#define TSENS_WINUT_REG_OFST           (0x14)              /**< (TSENS_WINUT) Window Monitor Upper Threshold Register Offset */
#define TSENS_GAIN_REG_OFST            (0x18)              /**< (TSENS_GAIN) Gain Register Offset */
#define TSENS_OFFSET_REG_OFST          (0x1C)              /**< (TSENS_OFFSET) Offset Register Offset */
#define TSENS_CAL_REG_OFST             (0x20)              /**< (TSENS_CAL) Calibration Register Offset */
#define TSENS_DBGCTRL_REG_OFST         (0x24)              /**< (TSENS_DBGCTRL) Debug Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TSENS register API structure */
typedef struct
{  /* Temperature Sensor */
  __IO  uint8_t                        TSENS_CTRLA;        /**< Offset: 0x00 (R/W  8) Control A Register */
  __O   uint8_t                        TSENS_CTRLB;        /**< Offset: 0x01 ( /W  8) Control B Register */
  __IO  uint8_t                        TSENS_CTRLC;        /**< Offset: 0x02 (R/W  8) Control C Register */
  __IO  uint8_t                        TSENS_EVCTRL;       /**< Offset: 0x03 (R/W  8) Event Control Register */
  __IO  uint8_t                        TSENS_INTENCLR;     /**< Offset: 0x04 (R/W  8) Interrupt Enable Clear Register */
  __IO  uint8_t                        TSENS_INTENSET;     /**< Offset: 0x05 (R/W  8) Interrupt Enable Set Register */
  __IO  uint8_t                        TSENS_INTFLAG;      /**< Offset: 0x06 (R/W  8) Interrupt Flag Status and Clear Register */
  __I   uint8_t                        TSENS_STATUS;       /**< Offset: 0x07 (R/   8) Status Register */
  __I   uint32_t                       TSENS_SYNCBUSY;     /**< Offset: 0x08 (R/   32) Synchronization Busy Register */
  __I   uint32_t                       TSENS_VALUE;        /**< Offset: 0x0C (R/   32) Value Register */
  __IO  uint32_t                       TSENS_WINLT;        /**< Offset: 0x10 (R/W  32) Window Monitor Lower Threshold Register */
  __IO  uint32_t                       TSENS_WINUT;        /**< Offset: 0x14 (R/W  32) Window Monitor Upper Threshold Register */
  __IO  uint32_t                       TSENS_GAIN;         /**< Offset: 0x18 (R/W  32) Gain Register */
  __IO  uint32_t                       TSENS_OFFSET;       /**< Offset: 0x1C (R/W  32) Offset Register */
  __IO  uint32_t                       TSENS_CAL;          /**< Offset: 0x20 (R/W  32) Calibration Register */
  __IO  uint8_t                        TSENS_DBGCTRL;      /**< Offset: 0x24 (R/W  8) Debug Control Register */
} tsens_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMC21_TSENS_COMPONENT_H_ */
